In [1]:
import numpy as np

import pandas as pd

In [2]:
index1=['G1','G1','G1','G2','G2','G2']
index2=[1,2,3,1,2,3]
hier_index=list(zip(index1,index2))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [3]:
index1

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [4]:
index2

[1, 2, 3, 1, 2, 3]

In [5]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [6]:
hier_index=list(zip(index1,index2))
np.random.randn

In [7]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [11]:
np.random.rand(3,4)

array([[0.28717804, 0.13067912, 0.55718848, 0.58690849],
       [0.27280076, 0.95968057, 0.42681776, 0.44883633],
       [0.09293918, 0.12849676, 0.08579565, 0.44697134]])

In [12]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [13]:
df=pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [16]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [17]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [18]:
df.fillna(value='fill value')

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [19]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [20]:
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['sam','charlie','amy','vanessa','carl','sarah'],
     'sales':[200,120,340,124,243,350]}

In [21]:
df=pd.DataFrame(data)

In [22]:
df

  company   Person  sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [23]:
bycomp=df.groupby('company')

In [24]:
bycomp.mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [25]:
bycomp.sum()

         sales
company
FB         593
GOOG       320
MSFT       464

In [26]:
bycomp.std()

              sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [27]:
bycomp.sum()

         sales
company
FB         593
GOOG       320
MSFT       464

In [28]:
df.groupby('company').sum().loc['FB']

sales    593
Name: FB, dtype: int64

In [29]:
 df.groupby('company').count()

         Person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [30]:
df.groupby('company').max()

          Person  sales
company
FB         sarah    350
GOOG         sam    200
MSFT     vanessa    340

In [31]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [32]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                      index=[0,1,2,3])

In [33]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
                      index=[4,5,6,7])

In [34]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
                      index=[8,9,10,11])

In [35]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [36]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [37]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [38]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [39]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11